<a href="https://colab.research.google.com/github/varunjakanur/BC/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.29)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 7.7 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite://

In [ ]:
%%sql
create table student(
  id int primary key,
  name varchar(50),
  age int not null
);

UsageError: Cell magic `%%sql` not found.

In [ ]:
%%sql
select * from student;

 * sqlite://
Done.

[]

In [ ]:
%%sql
insert into student values(1,"varun",26);
insert into student values(2,"aman",28);

 * sqlite://
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
select * from student;

 * sqlite://
Done.

[(1, 'varun', 26), (2, 'aman', 28)]

In [ ]:
%%sql
insert into student values(2,"aman",28);

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from student;

 * sqlite://
Done.

[(1, 'varun', 26), (2, 'aman', 28)]

In [ ]:
%%sql
create database if not exists collage

 * sqlite://
(sqlite3.OperationalError) near "database": syntax error
[SQL: create database if not exists collage]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
show databases

 * sqlite://
(sqlite3.OperationalError) near "show": syntax error
[SQL: show databases]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
drop table if exists student;

 * sqlite://
Done.

[]

In [ ]:
%%sql
show tables;

 * sqlite://
(sqlite3.OperationalError) near "show": syntax error
[SQL: show tables;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
create table student(
  roll_no int primary key,
  name varchar(50)
);

insert into student (roll_no,name)values
                    (101,"karan"),
                    (102,"arjun"),
                    (103,"ram");

 * sqlite://
Done.
3 rows affected.

[]

In [ ]:
%%sql
select * from student;

 * sqlite://
Done.

[(101, 'karan'), (102, 'arjun'), (103, 'ram')]

In [ ]:
%%sql
insert into student values(104,"shyam");

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
CREATE DATABASE xyz;

 * sqlite://
(sqlite3.OperationalError) near "DATABASE": syntax error
[SQL: CREATE DATABASE xyz;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
create table employee(
  id int primary key,
  name varchar(50),
  salary int
);

 * sqlite://
Done.

[]

In [ ]:
%%sql
insert into employee values
                    (1,"adam",25000),
                    (2,"bob",30000),
                    (3,"casey",40000);

 * sqlite://
3 rows affected.

[]

In [ ]:
%%sql
select * from employee;

 * sqlite://
Done.

[(1, 'adam', 25000), (2, 'bob', 30000), (3, 'casey', 40000)]

In [ ]:
%%sql
select name from employee
where salary=30000;

 * sqlite://
Done.

[('bob',)]

In [ ]:
%%sql
select id,salary from employee
where name="bob" OR id=3;

 * sqlite://
Done.

[(2, 30000), (3, 40000)]

In [ ]:
%%sql
select * from employee
where salary between 30000 and 50000;

 * sqlite://
Done.

[(2, 'bob', 30000), (3, 'casey', 40000)]

In [ ]:
%%sql
select * from employee
where salary IN(30000,40000,50000) ;

 * sqlite://
Done.

[(2, 'bob', 30000), (3, 'casey', 40000)]

In [ ]:
%%sql
select * from employee
where salary not IN(30000,40000,50000) ;

 * sqlite://
Done.

[(1, 'adam', 25000)]

In [ ]:
%%sql
select * from employee
limit 2 ;

 * sqlite://
Done.

[(1, 'adam', 25000), (2, 'bob', 30000)]

In [ ]:
%%sql
select * from employee
where salary>=30000
limit 2 ;

 * sqlite://
Done.

[(2, 'bob', 30000), (3, 'casey', 40000)]

In [ ]:
%%sql
select * from employee
order by name desc;

 * sqlite://
Done.

[(3, 'casey', 40000), (2, 'bob', 30000), (1, 'adam', 25000)]

In [ ]:
%%sql
select * from employee
order by name desc
limit 2;

 * sqlite://
Done.

[(3, 'casey', 40000), (2, 'bob', 30000)]

In [ ]:
%%sql
create table emp(
  id int primary key,
  salary int default 25000
);

 * sqlite://
Done.

[]

In [ ]:
%%sql
insert into emp values(101," ");

 * sqlite://
(sqlite3.IntegrityError) UNIQUE constraint failed: emp.id
[SQL: insert into emp values(101," ");]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql
insert into emp(id)values(102);
select * from emp

UsageError: Cell magic `%%sql` not found.

In [ ]:
%%sql
create table check_constraint(
  id int primary key,
  salary int check (salary>10000)
);

 * sqlite://
Done.

[]

In [ ]:
%%sql
insert into check_constraint values(1,5000);

 * sqlite://
(sqlite3.IntegrityError) CHECK constraint failed: salary>10000
[SQL: insert into check_constraint values(1,5000);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql
insert into check_constraint values(1,15000);

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from check_constraint

 * sqlite://
Done.

[(1, 15000)]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS student1 (
  id int(2) NOT NULL DEFAULT '0',
  name varchar(50) NOT NULL DEFAULT ''
) ;

 * sqlite://
Done.

[]

In [ ]:
%%sql

INSERT INTO student1 (id, name) VALUES
(1, "John Deo"),
(2, "Max Ruin"),
(3, "Arnold"),
(4, "Krish Star"),
(5, "John Mike"),
(6, "Alex John"),
(7, "My John Rob"),
(8, "Asruid"),
(9, "Tes Qry"),
(10, "Big John"),
(11, "Ronald"),
(12, "Recky"),
(13, "Kty");

 * sqlite://
13 rows affected.

[]

In [ ]:
%%sql
select * from student1

 * sqlite://
Done.

[(1, 'John Deo'),
 (2, 'Max Ruin'),
 (3, 'Arnold'),
 (4, 'Krish Star'),
 (5, 'John Mike'),
 (6, 'Alex John'),
 (7, 'My John Rob'),
 (8, 'Asruid'),
 (9, 'Tes Qry'),
 (10, 'Big John'),
 (11, 'Ronald'),
 (12, 'Recky'),
 (13, 'Kty')]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS student2 (
  id int(2) NOT NULL DEFAULT '0',
  mark int(3) NOT NULL DEFAULT '0'
) ;

 * sqlite://
Done.

[]

In [ ]:
%%sql

INSERT INTO student2 (id,mark) VALUES
(1,  75),
(2,   85),
(3,  55),
(4,   60),
(5,   89),
(6,   55),
(7,   78),
(8, 85),
(9,   78),
(10,   55),
(11,   89),
(12,   94),
(13,  88);

 * sqlite://
13 rows affected.

[]

In [ ]:
%%sql
drop table student1;

 * sqlite://
Done.

[]

In [ ]:
%%sql
select * from student2

 * sqlite://
Done.

[(1, 75),
 (2, 85),
 (3, 55),
 (4, 60),
 (5, 89),
 (6, 55),
 (7, 78),
 (8, 85),
 (9, 78),
 (10, 55),
 (11, 89),
 (12, 94),
 (13, 88)]

In [ ]:
%%sql
select name,student1.id
from student2,student1
where student1.id=student2.id and mark = (select max(mark)
                                          from student2
                                          where mark<(select max(mark)
                                                      from student2))

 * sqlite://
Done.

[('John Mike', 5), ('Ronald', 11)]

In [ ]:
%%sql
select avg(mark) from student1;

 * sqlite://
Done.

[(73.61538461538461,)]

In [ ]:
%%sql
select min(mark) from student1;

 * sqlite://
Done.

[(55,)]

In [ ]:
%%sql
select max(mark) from student1;

 * sqlite://
Done.

[(94,)]

In [ ]:
%%sql
select count(id) from student1;

 * sqlite://
Done.

[(13,)]

In [ ]:
%%sql
select class, count(id),avg(mark)
from student1
group by class
order by avg(mark) asc;

 * sqlite://
Done.

[('Four', 5, 61.0),
 ('Three', 2, 70.0),
 ('Five', 2, 81.5),
 ('Six', 3, 87.0),
 ('Seven', 1, 88.0)]

/*count number of students in each class having marks grater than 70*/

In [ ]:
%%sql

select class,count(id)
from student1
where mark>70
group by class;

 * sqlite://
Done.

[('Five', 2), ('Four', 1), ('Seven', 1), ('Six', 3), ('Three', 1)]

/*count number of students in those classes having a student marks grater than 70*/

In [ ]:
%%sql

select class,count(id)
from student1
group by class
having max(mark)>80;

 * sqlite://
Done.

[('Five', 2), ('Seven', 1), ('Six', 3), ('Three', 2)]

GENERAL ORDER

In [ ]:
%%sql
/*General Order*/
select
from
where
group by
having
order by;

##UPDATE TABLE

In [ ]:
%%sql
/*update table*/
update student1
set mark=78
where id=1;

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from student1

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 78, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

##DELETE some existing rows

In [ ]:
%%sql
delete from student1
where mark>90;

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from student1

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 78, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

##Foreign Key

In [ ]:
%%sql
create table dept(
    id int primary key,
    name varchar(50)
)

 * sqlite://
Done.

[]

In [ ]:
%%sql
create table teacher(
    id int primary key,
    name varchar(50),
    dept_id int,
    foreign key(dept_id) references dept
)

 * sqlite://
Done.

[]

In [ ]:
%%sql
insert into dept values(101,"science"),(102,"hindi"),(103,"English");
insert into teacher values(1,"varun",101),(2,"rohit",103),(3,"kiran",102),(4,"nikhil",101);

 * sqlite://
3 rows affected.
4 rows affected.

[]

In [ ]:
%%sql
select * from dept;
select * from teacher;

 * sqlite://
Done.
Done.

[(1, 'varun', 101), (2, 'rohit', 103), (3, 'kiran', 102), (4, 'nikhil', 101)]

In [ ]:
%%sql
select t.name from teacher as t,dept as d
where d.id=t.dept_id and d.name = "science";

 * sqlite://
Done.

[('varun',), ('nikhil',)]

##Cascading

In [ ]:
%%sql
drop table teacher;

 * sqlite://
Done.

[]

In [ ]:
%%sql
drop table dept;

 * sqlite://
Done.

[]

##Cascade

In [ ]:
%%sql
create table dept(
    id int primary key,
    name varchar(50)

);

 * sqlite://
Done.

[]

In [ ]:
%%sql
create table teacher(
    id int primary key,
    name varchar(50),
    dept_id int,
    foreign key(dept_id) references dept
    on update cascade
    on delete cascade
);

 * sqlite://
Done.

[]

 * sqlite://
0 rows affected.

[]

In [ ]:
%%sql
insert into dept values(101,"science"),(102,"hindi"),(103,"English");
insert into teacher values(1,"varun",101),(2,"rohit",103),(3,"kiran",102),(4,"nikhil",101);

 * sqlite://
3 rows affected.
4 rows affected.

[]

In [ ]:
%%sql
update dept
set id=111
where id=101;

 * sqlite://
0 rows affected.

[]

In [ ]:
%%sql
select * from dept

 * sqlite://
Done.

[(111, 'science'), (102, 'hindi'), (103, 'English')]

In [ ]:
%%sql
select * from teacher

 * sqlite://
Done.

[(1, 'varun', 101), (2, 'rohit', 103), (3, 'kiran', 102), (4, 'nikhil', 101)]

##Table related queries

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS student (
  id int(2) NOT NULL DEFAULT '0',
  name varchar(50) NOT NULL DEFAULT '',
  class varchar(10) NOT NULL DEFAULT '',
  mark int(3) NOT NULL DEFAULT '0',
  gender varchar(6)  NOT NULL DEFAULT 'male'
) ;

 * sqlite://
Done.

[]

In [ ]:
%%sql
INSERT INTO student(id, name, class, mark, gender) VALUES
(1, "John Deo", "Four", 75, "female"),
(2, "Max Ruin", "Three", 85, "male"),
(3, "Arnold", "Three", 55, "male"),
(4, "Krish Star", "Four", 60, "female"),
(5, "John Mike", "Four", 60, "female"),
(6, "Alex John", "Four", 55,"male"),
(7, "My John Rob", "Five", 78, "male"),
(8, "Asruid", "Five", 85, "male"),
(9, "Tes Qry", "Six", 78, "male"),
(10, "Big John", "Four", 55, "female"),
(11, "Ronald", "Six", 89, "female"),
(12, "Recky", "Six", 94, "female"),
(13, "Kty", "Seven", 88, "female");

 * sqlite://
13 rows affected.

[]

In [ ]:
%%sql
select * from student

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 75, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

In [ ]:
%%sql
alter table student
add column age

 * sqlite://
Done.

[]

In [ ]:
%%sql
select * from student

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 75, 'female', None),
 (2, 'Max Ruin', 'Three', 85, 'male', None),
 (3, 'Arnold', 'Three', 55, 'male', None),
 (4, 'Krish Star', 'Four', 60, 'female', None),
 (5, 'John Mike', 'Four', 60, 'female', None),
 (6, 'Alex John', 'Four', 55, 'male', None),
 (7, 'My John Rob', 'Five', 78, 'male', None),
 (8, 'Asruid', 'Five', 85, 'male', None),
 (9, 'Tes Qry', 'Six', 78, 'male', None),
 (10, 'Big John', 'Four', 55, 'female', None),
 (11, 'Ronald', 'Six', 89, 'female', None),
 (12, 'Recky', 'Six', 94, 'female', None),
 (13, 'Kty', 'Seven', 88, 'female', None)]

In [ ]:
%%sql
alter table student
drop column age

 * sqlite://
Done.

[]

In [ ]:
%%sql
select * from student

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 75, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

In [ ]:
%%sql
alter table student
rename to stud

 * sqlite://
Done.

[]

In [ ]:
%%sql
select * from stud

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 75, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

In [ ]:
%%sql
alter table stud
change mark marks int;

 * sqlite://
(sqlite3.OperationalError) near "change": syntax error
[SQL: alter table stud
change mark marks int;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
truncate table stud;

 * sqlite://
(sqlite3.OperationalError) near "truncate": syntax error
[SQL: truncate table stud;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
select * from student1

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 75, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

In [ ]:
%%sql
insert into stud(id,name)
select id,name from student1;

 * sqlite://
(sqlite3.OperationalError) no such table: stud
[SQL: insert into stud(id,name)
select id,name from student1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
select * from stud

 * sqlite://
(sqlite3.OperationalError) no such table: stud
[SQL: select * from stud]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS student (
  id int(2) NOT NULL DEFAULT '0',
  name varchar(50) NOT NULL DEFAULT ''
) ;

 * sqlite://
Done.

[]

In [ ]:
%%sql
INSERT INTO student(id, name) VALUES
(1, "John Deo"),
(2, "Max Ruin"),
(3, "Arnold"),
(4, "Krish Star"),
(5, "John Mike"),
(6, "Alex John"),
(7, "My John Rob"),
(8, "Asruid"),
(9, "Tes Qry"),
(10, "Big John"),
(11, "Ronald"),
(12, "Recky"),
(13, "Kty");

 * sqlite://
13 rows affected.

[]

In [ ]:
%%sql
select * from student

 * sqlite://
Done.

[(1, 'John Deo'),
 (2, 'Max Ruin'),
 (3, 'Arnold'),
 (4, 'Krish Star'),
 (5, 'John Mike'),
 (6, 'Alex John'),
 (7, 'My John Rob'),
 (8, 'Asruid'),
 (9, 'Tes Qry'),
 (10, 'Big John'),
 (11, 'Ronald'),
 (12, 'Recky'),
 (13, 'Kty')]

In [ ]:
%%sql
select * from student1

 * sqlite://
Done.

[(1, 'John Deo', 'Four', 75, 'female'),
 (2, 'Max Ruin', 'Three', 85, 'male'),
 (3, 'Arnold', 'Three', 55, 'male'),
 (4, 'Krish Star', 'Four', 60, 'female'),
 (5, 'John Mike', 'Four', 60, 'female'),
 (6, 'Alex John', 'Four', 55, 'male'),
 (7, 'My John Rob', 'Five', 78, 'male'),
 (8, 'Asruid', 'Five', 85, 'male'),
 (9, 'Tes Qry', 'Six', 78, 'male'),
 (10, 'Big John', 'Four', 55, 'female'),
 (11, 'Ronald', 'Six', 89, 'female'),
 (12, 'Recky', 'Six', 94, 'female'),
 (13, 'Kty', 'Seven', 88, 'female')]

In [ ]:
%%sql
alter table student1
drop class

 * sqlite://
Done.

[]

In [ ]:
%%sql
select * from student1
order bY mark desc

UsageError: Cell magic `%%sql` not found.

In [ ]:
%%sql
select name
from student as a,student1 as b
where a.id=b.id and a.id in (select id from student1 )
having mark<max(mark)
order by mark desc

 * sqlite://
(sqlite3.OperationalError) a GROUP BY clause is required before HAVING
[SQL: select name
from student as a,student1 as b
where a.id=b.id and a.id in (select id from student1 )
having mark<max(mark)
order by mark desc]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql